OdDAIHostAppServicesBase.findSchemaFileName(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the name of the file that contains an EXPRESS schema definition associated with a specified schema identifier.
\param schemaIdentifier [in] An ANSI string that contains the schema identifier
\returns An OdAnsiString object that contains the name of the file that contains the EXPRESS schema definition.
\remarks
Default implementation contains mapping for following supported schemas:
IdentifierProtocolCONFIG_CONTROL_DESIGNAP203AP203_CONFIGURATION_CONTROLLED_3D_DESIGN_OF_MECHANICAL_PARTS_AND_ASSEMBLIES_MIM_LFap203ed2_mim_lf.expAUTOMOTIVE_DESIGNAP214INTEGRATED_CNC_SCHEMAAP238AP242_MANAGED_MODEL_BASED_3D_ENGINEERING_MIM_LFAP242AP209_MULTIDISCIPLINARY_ANALYSIS_AND_DESIGN_MIM_LFAP209STRUCTURAL_FRAME_SCHEMACIS/2

OdDAIHostAppServicesBase.findFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject*,OdDbBaseHostAppServices.FindFileHint)
\details
Searches for a specified file and returns its full path.
\param fileName [in] A string that contains the name of the file.
\param pDb      [in] A raw pointer to the database context.
\param hint     [in] A hint that indicates the type of file that is required.
\returns A string that contains the full path of the file, or an empty string if the file is not found.
\sa
OdDbBaseHostAppServices::findFile Method

OdDAIHostAppServicesBase.databaseClass
\details
Retrieves the Data Access Interface database class description.
\returns The desc() method's result of the OdIfcFile object.

OdDAIHostAppServicesBase
\details
A class that implements platform specific operations within the Data Access Interface functionality.